EDT/УТ/src/Documents/МонтированиеОборудования/МонтированиеОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МонтированиеОборудования</name>
  <registerRecords>InformationRegister.СвязанноеОборудование</registerRecords>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>РегиональныйТерминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>ОборудованиеВладелец</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>ОборудованиеПодчиненное</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусМонтирования</name>
      <type>
        <types>EnumRef.СтатусыМонтированияОборудования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/СвязанноеОборудование/СвязанноеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязанноеОборудование</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусМонтирования</name>
    <type>
      <types>EnumRef.СтатусыМонтированияОборудования</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОборудованиеВладелец</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОборудованиеПодчиненное</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/МонтированиеОборудования/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.СвязанноеОборудование.Очистить();
	Движения.СвязанноеОборудование.Записывать = Истина;
	
	Для Каждого СтрокаОборудования Из Оборудование Цикл
		Движение = Движения.СвязанноеОборудование.Добавить();
		Движение.Период = Дата;
		Движение.Пользователь = Пользователь;
		ЗаполнитьЗначенияСвойств(Движение, СтрокаОборудования);
	КонецЦикла;
	
	
КонецПроцедуры
